MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m031l/thirdparty/m031l/uuart_reg.h
#define UUART_PROTCTL_BRDETITV_Pos   (16)                                          /*!< UUART_T::PROTCTL: BRDETITV Position*/
#define UUART_PROTCTL_BRDETITV_Msk   (0x1fful << UUART_PROTCTL_BRDETITV_Pos)       /*!< UUART_T::PROTCTL: BRDETITV Mask    */

#define UUART_PROTCTL_STICKEN_Pos    (26)                                          /*!< UUART_T::PROTCTL: STICKEN Position */
#define UUART_PROTCTL_STICKEN_Msk    (0x1ul << UUART_PROTCTL_STICKEN_Pos)          /*!< UUART_T::PROTCTL: STICKEN Mask     */

#define UUART_PROTCTL_BCEN_Pos       (29)                                          /*!< UUART_T::PROTCTL: BCEN Position    */
#define UUART_PROTCTL_BCEN_Msk       (0x1ul << UUART_PROTCTL_BCEN_Pos)             /*!< UUART_T::PROTCTL: BCEN Mask        */

#define UUART_PROTCTL_PROTEN_Pos     (31)                                          /*!< UUART_T::PROTCTL: PROTEN Position  */
#define UUART_PROTCTL_PROTEN_Msk     (0x1ul << UUART_PROTCTL_PROTEN_Pos)           /*!< UUART_T::PROTCTL: PROTEN Mask      */

#define UUART_PROTIEN_ABRIEN_Pos     (1)                                           /*!< UUART_T::PROTIEN: ABRIEN Position  */
#define UUART_PROTIEN_ABRIEN_Msk     (0x1ul << UUART_PROTIEN_ABRIEN_Pos)           /*!< UUART_T::PROTIEN: ABRIEN Mask      */

#define UUART_PROTIEN_RLSIEN_Pos     (2)                                           /*!< UUART_T::PROTIEN: RLSIEN Position  */
#define UUART_PROTIEN_RLSIEN_Msk     (0x1ul << UUART_PROTIEN_RLSIEN_Pos)           /*!< UUART_T::PROTIEN: RLSIEN Mask      */

#define UUART_PROTSTS_TXSTIF_Pos     (1)                                           /*!< UUART_T::PROTSTS: TXSTIF Position  */
#define UUART_PROTSTS_TXSTIF_Msk     (0x1ul << UUART_PROTSTS_TXSTIF_Pos)           /*!< UUART_T::PROTSTS: TXSTIF Mask      */

#define UUART_PROTSTS_TXENDIF_Pos    (2)                                           /*!< UUART_T::PROTSTS: TXENDIF Position */
#define UUART_PROTSTS_TXENDIF_Msk    (0x1ul << UUART_PROTSTS_TXENDIF_Pos)          /*!< UUART_T::PROTSTS: TXENDIF Mask     */

#define UUART_PROTSTS_RXSTIF_Pos     (3)                                           /*!< UUART_T::PROTSTS: RXSTIF Position  */
#define UUART_PROTSTS_RXSTIF_Msk     (0x1ul << UUART_PROTSTS_RXSTIF_Pos)           /*!< UUART_T::PROTSTS: RXSTIF Mask      */

#define UUART_PROTSTS_RXENDIF_Pos    (4)                                           /*!< UUART_T::PROTSTS: RXENDIF Position */
#define UUART_PROTSTS_RXENDIF_Msk    (0x1ul << UUART_PROTSTS_RXENDIF_Pos)          /*!< UUART_T::PROTSTS: RXENDIF Mask     */

#define UUART_PROTSTS_PARITYERR_Pos  (5)                                           /*!< UUART_T::PROTSTS: PARITYERR Position*/
#define UUART_PROTSTS_PARITYERR_Msk  (0x1ul << UUART_PROTSTS_PARITYERR_Pos)        /*!< UUART_T::PROTSTS: PARITYERR Mask   */

#define UUART_PROTSTS_FRMERR_Pos     (6)                                           /*!< UUART_T::PROTSTS: FRMERR Position  */
#define UUART_PROTSTS_FRMERR_Msk     (0x1ul << UUART_PROTSTS_FRMERR_Pos)           /*!< UUART_T::PROTSTS: FRMERR Mask      */

#define UUART_PROTSTS_BREAK_Pos      (7)                                           /*!< UUART_T::PROTSTS: BREAK Position   */
#define UUART_PROTSTS_BREAK_Msk      (0x1ul << UUART_PROTSTS_BREAK_Pos)            /*!< UUART_T::PROTSTS: BREAK Mask       */

#define UUART_PROTSTS_ABRDETIF_Pos   (9)                                           /*!< UUART_T::PROTSTS: ABRDETIF Position*/
#define UUART_PROTSTS_ABRDETIF_Msk   (0x1ul << UUART_PROTSTS_ABRDETIF_Pos)         /*!< UUART_T::PROTSTS: ABRDETIF Mask    */

#define UUART_PROTSTS_RXBUSY_Pos     (10)                                          /*!< UUART_T::PROTSTS: RXBUSY Position  */
#define UUART_PROTSTS_RXBUSY_Msk     (0x1ul << UUART_PROTSTS_RXBUSY_Pos)           /*!< UUART_T::PROTSTS: RXBUSY Mask      */

#define UUART_PROTSTS_ABERRSTS_Pos   (11)                                          /*!< UUART_T::PROTSTS: ABERRSTS Position*/
#define UUART_PROTSTS_ABERRSTS_Msk   (0x1ul << UUART_PROTSTS_ABERRSTS_Pos)         /*!< UUART_T::PROTSTS: ABERRSTS Mask    */

#define UUART_PROTSTS_CTSSYNCLV_Pos  (16)                                          /*!< UUART_T::PROTSTS: CTSSYNCLV Position*/
#define UUART_PROTSTS_CTSSYNCLV_Msk  (0x1ul << UUART_PROTSTS_CTSSYNCLV_Pos)        /*!< UUART_T::PROTSTS: CTSSYNCLV Mask   */

#define UUART_PROTSTS_CTSLV_Pos      (17)                                          /*!< UUART_T::PROTSTS: CTSLV Position   */
#define UUART_PROTSTS_CTSLV_Msk      (0x1ul << UUART_PROTSTS_CTSLV_Pos)            /*!< UUART_T::PROTSTS: CTSLV Mask       */

/**@}*/ /* UUART_CONST */
/**@}*/ /* end of UUART register group */


/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __UUART_REG_H__ */
